---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSizeIterator.IsDone
source: html/c1785078-5508-9c4c-ffaf-cd0be293b804.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizeIterator.IsDone Method

Identifies if the iteration has completed.

## Syntax (C#)
```csharp
public virtual bool IsDone()
```

## Returns
True if the iteration has no more items. False if there are more items to be iterated.